class LegalConstants {
  static const String privacyPolicyTitle = 'سياسة الخصوصية';
  static const String privacyPolicyContent = '''
مرحباً بك في تطبيق "My Party". نحن ندرك أهمية خصوصيتك ونلتزم بحماية بياناتك الشخصية.

1. المعلومات التي نجمعها:
نجمع المعلومات التي تقدمها لنا عند التسجيل، مثل الاسم، البريد الإلكتروني، ورقم الهاتف، بالإضافة إلى تفاصيل الفعاليات التي تقوم بتنظيمها.

2. كيف نستخدم معلوماتك:
نستخدم هذه المعلومات لتحسين تجربة المستخدم، وتسهيل التواصل بين العملاء والمنسقين والمزودين، وضمان سير العمليات بفعالية.

3. حماية البيانات:
نحن نستخدم إجراءات أمنية متطورة لحماية معلوماتك من الوصول غير المصرح به أو التغيير أو الإفصاح.

4. مشاركة المعلومات:
لا نقوم ببيع أو تأجير معلوماتك الشخصية لأطراف ثالثة. يتم مشاركة المعلومات الضرورية فقط مع الأطراف المعنية داخل التطبيق لإتمام الخدمات المطلوبة.

5. حقوقك:
لك الحق في الوصول إلى بياناتك الشخصية وتصحيحها أو طلب حذفها في أي وقت من خلال إعدادات الحساب.

باستخدامك للتطبيق، فإنك توافق على سياسة الخصوصية هذه.
''';

  static const String termsConditionsTitle = 'الشروط والأحكام';
  static const String termsConditionsContent = '''
باستخدامك لتطبيق "My Party"، فإنك توافق على الالتزام بالشروط والأحكام التالية:

1. قبول الشروط:
بمجرد تنزيل التطبيق أو استخدامه، فإنك توافق على هذه الشروط بالكامل. إذا كنت لا توافق على أي جزء منها، فيجب عليك التوقف عن استخدام التطبيق.

2. وصف الخدمة:
"My Party" هو منصة تقنية تهدف إلى الربط بين منسقي الحفلات، والمزودين، والعملاء لتسهيل عملية تنظيم الفعاليات والمناسبات.

3. الحسابات والمسؤولية:
أنت مسؤول عن الحفاظ على سرية معلومات حسابك وكلمة المرور، وعن جميع الأنشطة التي تحدث تحت حسابك.

4. السلوك المقبول:
يُحظر استخدام التطبيق لأي أغراض غير قانونية أو انتهاك حقوق الآخرين. يجب تقديم معلومات دقيقة وصحيحة دائماً.

5. الرسوم والمدفوعات:
يتم توضيح أي رسوم متعلقة بالخدمات داخل التطبيق. نحن نقوم بدور الوسيط لتسهيل العمليات المالية، وتخضع المدفوعات لسياسات الالغاء الموضحة لكل خدمة.

6. إخلاء المسؤولية:
نحن نبذل قصارى جهدنا لضمان جودة الخدمات، ولكننا لا نتحمل المسؤولية المباشرة عن جودة الخدمات المقدمة من قبل المزودين المستقلين، ومع ذلك، نسعى دائماً لحل أي خلافات قد تنشأ.

7. التعديلات:
نحتفظ بالحق في تعديل هذه الشروط في أي وقت، وسيتم إخطارك بأي تغييرات جوهرية.

شكراً لاختيارك My Party!
''';
}
